app/controllers/holiday_controller.rb

INSERT INTO "holidays" ("dateStart", "dateEnd", "reason", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["dateStart", "1901-11-11"], ["dateEnd", "1901-11-11"], ["reason", "11111"], ["user_id", 2], ["created_at", "2019-01-18 09:22:03.059837"], ["updated_at", "2019-01-18 09:22:03.059837"]]
---
			def create
					holiday = Holiday.new(holiday_params)
				#  byebug
					if holiday.save

SELECT "holidays".* FROM "holidays" ORDER BY updated_at DESC
---
			def getAllHolidays
				p = params[:p]
				holiday =Holiday.order('updated_at DESC')

SELECT "holidays".* FROM "holidays" WHERE "holidays"."user_id" = ? ORDER BY updated_at DESC  [["user_id", 3]]
---
			 def getUserHolidays
					 h = Holiday.where(user_id: params[:id]).order('updated_at DESC')

SELECT  "holidays".* FROM "holidays" WHERE "holidays"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "holidays" SET "state" = ?, "updated_at" = ? WHERE "holidays"."id" = ?  [["state", "accepted"], ["updated_at", "2019-01-19 00:03:36.984477"], ["id", 4]]
SELECT "holidays".* FROM "holidays" WHERE "holidays"."state" = ?  [["state", "pas encore traité"]]
---
			 def AcceptHoliday
					 p = params[:p]
					 holiday = Holiday.find(params[:id])
					 user = User.find(params[:user_id])
					 if holiday.update_attributes(holiday_params_Accept)
							 if user.update_attributes(user_params_AcceptConge)
							 holidays = Holiday.where(state:'waitlisted')